:PROPERTIES:
:ID:       51da34a8-7794-48ef-89c1-c152a4ecd30a
:END:
#+title: Sports - kettlebells
#+date: [2025-05-18 Sun 11:19]
* Kettlebells
** exercises
Kettlebell db swings
Kettlebell db press

** Regiments

| exercise          | weight (kg) | set | reps | done | total |
|-------------------+-------------+-----+------+------+-------|
| Kettlebell swings |          64 |   1 |   20 |   20 |  1280 |
| Kettlebell swings |          64 |   2 |   20 |   18 |  1152 |
| Kettlebell swings |          64 |   3 |   20 |   18 |  1152 |
#+TBLFM: $6=$2*$5
run ~C-c C-c~ on the TBLFM line to update all
